Autodesk.Revit.DB.ParameterUtils.DownloadCompanyName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ForgeTypeId)
Downloads the name of the given parameter's owning account and records it in the given document. If the owning
account's name is already recorded in the given document, this method returns the name without downloading it
again.
Remarks:
In Revit, the account name appears in the parameter tooltip if available.
document:
Document in which to record the name of the parameter's owning account.
parameterTypeId:
Parameter identifier.
Returns:
Name of the owning account.
Throws Autodesk.Revit.Exceptions.AccessDeniedException:
Thrown when the user is not authorized to access the requested information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the parameter identifier does not include an account identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk::Revit::Exceptions::NetworkCommunicationError:
Thrown when communication with the remote service is unsuccessful.
Throws Autodesk.Revit.Exceptions.ResourceNotFoundException:
Thrown when the requested information is not found
Throws Autodesk.Revit.Exceptions.ServerInternalException:
Thrown when the remote service reports an internal error.
Throws Autodesk.Revit.Exceptions.UnauthenticatedException:
Thrown when the user is not signed in.
Since:
2024